# 魔力之源坐标 (窗口客户区相对坐标)
MAGIC_FOUNTAIN_COORDS = [
    (56, 210),  # 魔力之源 1
    (196, 164),  # 魔力之源 2
    (332, 192),  # 魔力之源 3
    (129, 293),  # 魔力之源 4
    (55, 354),  # 魔力之源 5
    (149, 446),  # 魔力之源 6
    (280, 686),  # 魔力之源 7
    (250, 587),  # 魔力之源 8
    (234, 471),  # 魔力之源 9
    (254, 350),  # 魔力之源 10
    (358, 259),  # 魔力之源 11
    (451, 277),  # 魔力之源 12
    (524, 255),  # 魔力之源 13
    (468, 341),  # 魔力之源 14
    (579, 334),  # 魔力之源 15
    (346, 401),  # 魔力之源 16
    (486, 378),  # 魔力之源 17
    (529, 405),  # 魔力之源 18
    (751, 374),  # 魔力之源 19
    (803, 400),  # 魔力之源 20
    (915, 482),  # 魔力之源 21
    (916, 624),  # 魔力之源 22
    (815, 542),  # 魔力之源 23
    (805, 587),  # 魔力之源 24
    (731, 548),  # 魔力之源 25
    (747, 491),  # 魔力之源 26
    (647, 493),  # 魔力之源 27
    (579, 472),  # 魔力之源 28
    (565, 501),  # 魔力之源 29
    (443, 473),  # 魔力之源 30
    (346, 520),  # 魔力之源 31
    (481, 666),  # 魔力之源 32
    (510, 583),  # 魔力之源 33
    (588, 616),  # 魔力之源 34
    (656, 687),  # 魔力之源 35
]

# 传送按钮坐标 (窗口客户区相对坐标)
TELEPORT_BTN_COORD = (817, 736)
